Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: The option of 'get the file from the local cache' has been selected.
fr: L'option de 'obtenir le fichier du cache local »a été choisie.

source: Retrieve the filesize.
fr: Récupére la taille du fichier.

source: Returns detailed data for a handle returned from InetGet().
fr: Retourne les données détaillées d'un handle retourné par InetGet().

source: The index for the data to retrieve.
fr: L'index pour les données à récupérer.

source: If this value is -1 an array containing all of the below data will be returned.
fr: Si cette valeur est -1, un tableau contenant toutes les données ci-dessous sera retourné.

source: $INET_DOWNLOADREAD (0) - Bytes read so far (this is updated while the download progresses).
fr: $INET_DOWNLOADREAD (0) - Octets lus jusqu'à présent (mis à jour durant la progression du téléchargement).

source: $INET_DOWNLOADSIZE (1) - The size of the download in bytes (this may not always be present).
fr: $INET_DOWNLOADSIZE (1) - La taille du téléchargement en octets (ceci n'est pas toujours présent).

source: $INET_DOWNLOADCOMPLETE (2) - Set to True if the download is complete, False if the download is still ongoing.
fr: $INET_DOWNLOADCOMPLETE (2) - Met à True si le téléchargement est terminé, False si le téléchargement est en cours.

source: $INET_DOWNLOADSUCCESS (3) - True if the download was successful.
fr: $INET_DOWNLOADSUCCESS (3) - True si le téléchargement est un succès.

source: If this is False then the next data member will be non-zero.
fr: Si celui-ci est à False alors le membre de données suivante sera non-nulle.

source: $INET_DOWNLOADERROR (4) - The error value for the download.
fr: $INET_DOWNLOADERROR (4) - La valeur d'erreur pour le téléchargement.

source: The value itself is arbitrary.
fr: La valeur elle-même est arbitraire.

source: Testing that the value is non-zero is sufficient for determining if an error occurred.
fr: Tester que la valeur est non-nulle est suffisant pour déterminer si une erreur s'est produite.

source: $INET_DOWNLOADEXTENDED (5) - The extended value for the download.
fr: $INET_DOWNLOADEXTENDED (5) - La valeur étendue pour le téléchargement.

source: The value is arbitrary and is primarily only useful to the AutoIt developers.
fr: La valeur est arbitraire et est principalement utile aux développeurs d'AutoIt.

source: the request data.
fr: Retourne les données demandées.

source: If called with no arguments then the total number of active downloads will be returned.
fr: Si la fonction est appelée sans aucun argument alors le nombre total de téléchargements actifs sera retourné.

source: This function can be called in a loop to query the number of bytes download or to pause until a download is complete.
fr: Cette fonction peut-être appelée dans une boucle pour récupérer le nombre d'octets téléchargés ou pour faire une pause jusqu'à ce que le téléchargement soit complet.

source: Retrieve details about the download file.
fr: Consulte les détails sur le fichier de téléchargement.

source: If an error occurred the return from the function and delete the file.
fr: Si une erreur se produit la fonction retourne et supprime le fichier.

source: Display details about the downloaded file.
fr: Affiche les détails sur le fichier téléchargé.

source: Or use 0 instead of the constant.
fr: Ou utilisez 0 à la place de la constante.

source: Or use 1 instead of the constant.
fr: Ou utilisez 1 à la place de la constante.

source: Or use 2 instead of the constant.
fr: Ou utilisez 2 au lieu de la constante.

source: Or use 3 instead of the constant.
fr: Ou utilisez 3 à la place de la constante.

source: Or use 4 instead of the constant.
fr: Ou utilisez 4 au lieu de la constante.

source: Or use 5 instead of the constant.
fr: Ou utilisez 5 à la place de la constante.

source: Returns the size (in bytes) of a file located on the internet.
fr: Retourne la taille (en octets) d'un fichier situé sur internet.

source: $INET_LOCALCACHE (0) = Get the file from local cache if available (default).
fr: $INET_LOCALCACHE (0) = Récupère le fichier depuis le cache local si disponible (défaut).

source: (For ftp://
fr: (Pour les URLs ftp://,

source: URLs IE 5 is required!)
fr: IE 5 est requis !)

source: Not all servers will correctly give the file size, especially when using a proxy server.
fr: Tous les serveurs ne renverront pas correctement la taille du fichier, spécialement lors de l'utilisation d'un serveur proxy.

source: Retrieve the size of the file.
fr: Récupére la taille du fichier.

source: a binary string and @extended set to the number of bytes downloaded.
fr: Retourne une chaîne binaire et assigne à @extended le nombre d'octets téléchargés.

source: The returned data is in binary format.
fr: Les données retournées sont au format binaire.

source: The BinaryToString() function can be used to convert the data to a string.
fr: La fonction BinaryToString() peut-être utilisée pour convertir les données en chaîne.

source: Read the file without downloading to a folder.
fr: Lit le fichier sans le télécharger dans un dossier.

source: The number of bytes read is returned using the @extended macro.
fr: Le nombre d'octets lus est retourné en utilisant la macro @extended.

source: The filename of the .ini file.
fr: Nom du fichier .ini.

source: The section name in the .ini file.
fr: Nom de la section dans le fichier .ini.

source: The key name in the .ini file to delete.
fr: Nom de la clé à supprimer dans le fichier .ini.

source: If the key name is not given the entire section is deleted.
fr: Si le nom de la clé n'est pas donné, la section entière sera supprimée.

source: The Default keyword may also be used which will cause the section to be deleted.
fr: Le mot-clé "Default" peut aussi être utilisé pour supprimer la section.

source: 0 if the INI file does not exist or if the file is read-only.
fr: Retourne 0 si le fichier .ini n'existe pas ou s'il est en lecture seule.

source: A standard ini file looks like:
fr: Un fichier .ini standard est de la forme :

source: [SectionName]
fr: [Nom_De_La_Section]

source: Key=Value
fr: Clé=Valeur

source: Write the value of 'AutoIt' to the key 'Title' and in the section labelled 'General'.
fr: Ecrit la valeur "AutoIt" à la clé "Title" et dans la section "General".

source: Read the INI file for the value of 'Title' in the section labelled 'General'.
fr: Lit le fichier INI pour la valeur "Title" dans la section "General".

source: Display the value returned by IniRead.
fr: Affiche la valeur retournée par IniRead.

source: Delete the key labelled 'Title'.
fr: Supprime la clé portant la mention "Titre".

source: Since there is no key stored the value will be the 'Default Value' passed to IniRead.
fr: Comme il n'y a pas de clé stocké la valeur sera la 'Valeur par défaut 'passé à IniRead.

source: Delete the INI file.
fr: Supprimez le fichier INI.

source: The key name in the .ini file.
fr: Le nom de la clé dans le fichier .ini

source: The default value to return if the requested key is not found.
fr: La valeur de retour par défaut si la clé demandée n'est pas trouvée.

source: the requested key value as a string.
fr: Retourne la valeur de la clé demandée dans une chaîne.

source: the default string if requested key not found.
fr: Retourne la valeur par défaut si la clé demandée n'est pas trouvée.

source: All values returned are converted as a string.
fr: Toutes les valeurs retournées sont convertis sous forme de chaîne.

source: Therefore if you wish an integer e.g.1000 to be a number use either Int() or Number(), like-wise if you want a hwnd to be a ptr, the use Ptr() or HWnd().
fr: Par conséquent, si vous souhaitez qu'un 'integer', par exemple 1000, soit un nombre utilisez Int() ou Number(), tout comme si vous voulez qu'un hwnd soit un ptr, utilisez Ptr() ou HWnd().

source: a 2 dimensional array where element[n][0] is the key and element[n][1] is the value.
fr: Retourne un tableau à 2 dimensions où l'élément [n][0] est la clé et l'élément [n][1] est la valeur.

source: sets the @error flag to non-zero if unable to read the section (The INI file may not exist or the section may not exist or is empty)
fr: Retourne @error <> 0 si incapable de lire la section (Le fichier INI peut ne pas exister ou la section peut ne pas exister ou est vide )

source: The number of elements returned will be in $aArray[0][0].
fr: Le nombre d'éléments retournés sera dans $aArray[0][0].

source: If an @error occurs, no array is created.
fr: Si un @error se produit, aucun tableau n'est créé.

source: $aArray[0][0] = Number
fr: $aArray[0][0] = Nombre

source: $aArray[1][0] = 1st Key
fr: $aArray[1][0] = 1-ère clé

source: $aArray[1][1] = 1st Value
fr: $aArray[1][1] = 1-ère valeur

source: $aArray[2][0] = 2nd Key
fr: $aArray[2][0] = 2-ième clé

source: $aArray[2][1] = 2nd Value
fr: $aArray[2][1] = 2-ième caleur

source: $aArray[n][0] = nth Key
fr: $aArray[n][0] = n-ième clé

source: $aArray[n][1] = nth Value
fr: $aArray[n][1] = n-ième valeur

source: Only the first 32767 chars are read for legacy reasons.
fr: Seuls les 32767 premiers caractères sont lus pour des raisons historiques.

source: Create an INI section structure as a string.
fr: Crée une structure de section INI sous forme de chaîne.

source: Write the string to the section labelled 'General'.
fr: Ecrit la chaîne à la section "General".

source: Read the INI section labelled 'General'.
fr: Lit la section "Général".

source: This will return a 2 dimensional array.
fr: Ceci renvoie un tableau à 2 dimensions.

source: Check if an error occurred.
fr: Vérifie si une erreur s'est produite.

source: Enumerate through the array displaying the keys and their respective values.
fr: Énumére le tableau affichant les clés et leurs valeurs respectives.

source: an array of all section names in the INI file.
fr: Retourne un tableau contenant tous les noms de section du fichier INI.

source: sets the @error flag to non-zero
fr: Retourne @error <> 0

source: The number of elements returned will be in $aArray[0].
fr: Le nombre d'éléments retournés sera dans $aArray[0].

source: If an @error occurs, no array is returned.
fr: Si une @error se produit, aucun tableau n'est retourné.

source: Write the string to the sections labelled 'General', 'Version' and 'Other'.
fr: Écrire la chaîne avec les sections intitulées «General», «Version» et «Other».

source: Read the INI section names.
fr: Lit les noms des sections INI.

source: This will return a 1 dimensional array.
fr: Ce qui renvoie un tableau à 1 dimension.

source: Enumerate through the array displaying the section names.
fr: Énumére le tableau où figurent les noms des sections.

source: The new section name.
fr: Le nouveau nom de la section.

source: 0 (Default) - Fail if "new section" already exists.
fr: 0 ( par défaut ) - échoue si "nouvelle section" existe déjà.

source: 1 - Overwrite "new section".
fr: 1 - Remplace "nouvelle section".

source: This will erase any existing keys in "new section"
fr: Cela effacera toutes les clés existantes dans "nouvelle section"

source: Non-zero.
fr: Retourne une valeur non nulle.

source: 0 and may sets the @error flag to non-zero, if renaming failed because the section already exists (only when flag = 0).
fr: Retourne 0 et @error <> 0, si le renommage a échoué parce que la section existe déjà (seulement quand flag = 0).

source: Rename the section labelled 'General' to 'System'.
fr: Renomme la section 'General' en 'System'.

source: The value to write/change.
fr: La valeur à écrire/changer.

source: 0 if file is read-only.
fr: Retourne 0 si le fichier est en lecture seule.

source: If the file does not already exist, it is created so long as the directory exists.
fr: Si le fichier n'existe pas, il est créé, autant que le répertoire existe.

source: Keys and/or sections are added to the end and are not sorted in any way.
fr: Les clés et/ou les sections sont ajoutées à la fin et ne sont pas triées.

source: If you would like to wrap quotes around an ini value, then you need to double up the quotation marks as the first set of quotation marks are stripped.
fr: Lorsque vous écrivez une valeur qui est entre guillemets, les guillemets sont supprimés.Pour pouvoir écrire des guillemets dans la valeur, vous devez mettre des doubles guillemets entouré par des simple guillemets.

source: ""This is a test"" will produce "This is a test" when using IniRead() or such-like.
fr: ""Ceci est un test"" va produire "Ceci est un test" lors de l'utilisation de IniRead() ou semblable.

source: Leading and trailing whitespace is stripped.
fr: Les espaces de début et de fin sont supprimés.

source: In order to preserve the whitespace, the string must be quoted.
fr: Pour conserver les espaces, la chaîne de caractère doit être entre guillemets.

source: For example, " this is a test" will preserve the whitespace but per above, the quotation marks are stripped.
fr: Par exemple, " ceci est un test" préservera les espaces, mais comme vu plus haut les guillemets seront supprimés.

source: Multi-line values are not possible.
fr: Une valeur sur plusieurs lignes n'est pas possible.

source: If you want to use an ini file with Unicode encoding, first create an .ini file by using the FileOpen() function with the mode parameter set to a Unicode parameter.
fr: Si vous desirez utiliser un fichier ini avec un encodage Unicode, premièrement créez un fichier .ini en utilisant la fonction FileOpen() avec le paramètre de mode positionné sur Unicode.

source: The data to write.
fr: La donnée à écrire.

source: The data can either be a string or an array.
fr: La donnée peuvent être une chaîne ou un tableau.

source: If the data is a string, then each key=value pair must be delimited by @LF.
fr: Si la donnée est une chaîne, chaque paire clé/valeur doit être délimitée par @LF.

source: If the data is an array, the array must be 2-dimensional and the second dimension must be 2 elements.
fr: Si la donnée est un tableau, le tableau doit être de dimension 2 et la deuxième dimension doit être de 2 éléments.

source: If an array is passed as data, this specifies the index to start writing from.
fr: Si un tableau est transmis en données, ce paramètre indique l'indice à partir duquel l'écriture doit commencer.

source: By default, this is 1 so that the return value of IniReadSection() can be used immediately.
fr: Par défaut, c'est 1 de telle façon que la valeur de retour de IniReadSection() peut être utilisée immédiatement.

source: For manually created arrays, this value may need to be different depending on how the array was created.
fr: Pour les tableaux créés à la main, cette valeur peut être différente en fonction de la façon dont le réseau a été créé.

source: This parameter is ignored if a string is passed as data.
fr: Ce paramètre est ignoré si une chaîne est passée comme donnée.

source: 0.The function will sets the @error flag to 1 if the data format is invalid.
fr: Retourne 0 et @error = 1 si le format de la donnée n'est pas valide.

source: If file does not exist, it is created.
fr: Si le fichier n'existe pas, il est créé.

source: Any directories that do not exist, will not be created.
fr: Tous les répertoires qui n'existent pas, ne seront pas créés.

source: If the section being written already exists, its contents will be overwritten.
fr: Si la section à écrire existe déjà, son contenu sera écrasé.

source: If you want to use an ini file with unicode encoding, first create an .ini file by using the FileOpen() function with the mode parameter set to "Unicode UTF16 Little Endian".
fr: Si vous souhaitez utiliser un fichier ini avec le codage Unicode, créez d'abord un fichier ini en utilisant la fonction FileOpen() avec le paramètre de mode réglé sur "Unicode UTF16 Little Endian".

source: Create an INI section structure as an array.
fr: Crée une structure de section INI dans un tableau.

source: The zeroth element is how many items are in the array, in this case 3.
fr: L'élément zéro contient le nombre d'éléments du tableau, dans ce cas 3.

source: Write the array to the section labelled 'General'.
fr: Ecrit le tableau à la section 'General'.

source: Returns the integer (whole number) representation of an expression.
fr: Retourne la partie entière d'une expression (l'entier immédiatement inférieur).

source: An expression to convert into an integer.
fr: Une expression à convertir en un entier.

source: Defines behavior.
fr: Définit le comportement.

source: Default = the result is auto-sized integer.
fr: Par défaut = le résultat est un entier de taille automatique.

source: 1 = the result is 32bit integer.
fr: 1 = le résultat est un entier 32 bits.

source: 2 = the result is 64bit integer.
fr: 2 = le résultat est un entier 64 bits.

source: Returns an integer.
fr: Retourne un entier.

source: Default behavior is that if the result is within range of 32bit integer then 32bit integer is returned.
fr: Le comportement par défaut est que si le résultat est dans la plage des entiers 32 bits, alors un entier 32 bits est retourné.

source: If not, 64bit integer is returned.
fr: Si non, un entier 64 bits est retourné.

source: Both signed.
fr: Les deux sint signés.

source: Fractional portions are truncated, so Int(1.999999) returns 1
fr: La partie fractionnaire est tronqué, de sorte que Int(1.999999) renvoie 1

source: Int(0/0) returns -9223372036854775807, if you were wondering.
fr: Int(0/0 ) retourne -9223372036854775807, si vous vous posiez la question.

source: This function makes minor corrects to floating point numbers to account for the imprecise nature of floating point numbers.
fr: Cette fonction fait des corrections mineures sur les nombres à virgule flottante pour tenir compte de l'imprécision des nombres à virgule flottante.

source: For example, the floating point expression 0.7 + 0.2 + 0.1 produces a floating point number that is not quite 1.0.
fr: Par exemple, l'expression en virgule flottante 0,7 + 0,2 + 0,1 produit un nombre à virgule flottante qui n'est pas tout à fait 1.0.

source: Int() corrects for this anomaly, however, certain extremely rare circumstances may lead to Int() returning an unexpected value (the odds of getting an unexpected value are less than if Int() did not attempt any correction at all).
fr: Int() corrige cette anomalie, cependant, dans des circonstances extrèmement rares Int() peut retourner une valeur inattendue (les risques d'obtenir une valeur inattendue sont moindre que si Int() n'avait pas tenté de correction du tout).

source: Assign a Local variable the int representation of 10.793.
fr: Assigne une variable locale avec la partie entière de 10,793.

source: Checks if the current user has full administrator privileges.
fr: Vérifie si l'utilisateur a des droits d'administrateur complets.

source: 1 if the current user has administrator privileges.
fr: Retourne 1 si l'utilisateur courant a des droits d'administrateur.

source: 0 if user lacks admin privileges.
fr: Retourne 0 si l'utilisateur n'a pas les droits d'administrateur.

source: It returns 1 under Windows Vista only if running with a full administrator token (i.e.#RequireAdmin has been used, or has already been elevated by UAC).
fr: Elle retourne 1 sous Windows Vista seulement si vous avez les droits d'administrateur complet (par exemple, #RequireAdmin a été utilisée, ou a déjà été élevé par UAC).

source: Checks if a variable is an array type.
fr: Vérifie si une variable est de type tableau.

source: The variable/expression to check.
fr: Variable/Expression a vérifier.

source: 0 if parameter is not an array variable.
fr: Retourne 0 si le paramètre n'est pas une variable tableau.

source: Can be useful to validate array/non-array parameters to user-defined functions.
fr: Peut être utile afin de vérifier dans une librairie de fonctions (UDF) si un paramètre est de type tableau.

source: Retrieve the position and size of the Notepad window by passing the handle to WinGetPos.
fr: Récupére la position et la taille de la fenêtre du Bloc-notes en passant Le handle de WinGetPos.

source: Check if the variable is an array.
fr: Vérifie si la variable est un tableau.

source: Checks if a variable or expression is a binary type.
fr: Vérifie si une variable ou une expression est du type binaire.

source: The variable or expression to check.
fr: La variable ou expression à vérifier.

source: 0 if expression is not binary type.
fr: Retourne 0 si l'expression n'est pas de type binaire.

source: Checks if a variable's base type is boolean.
fr: Vérifie si le type d'une variable est un booléen.

source: 0 if expression is not boolean type.
fr: Retourne 0 si l'expression n'est pas de type booléen.

source: Check if a variable has been declared.
fr: Vérifiez si une variable a été déclarée.

source: string representing name of the variable to be checked.
fr: chaîne représentant le nom de la variable à contrôler.

source: 1 for Global variable or variable declared outside functions.
fr: Retourne 1 pour une variable 'Global' ou une variable déclarée fonctions externes.

source: -1 for Local variable.
fr: Retourne -1 Pour la variable 'Local'.

source: 0 when no variable can be found.
fr: 0 si aucune variable ne peut être trouvée.

source: If there is a need to use IsDeclared() to check that a variable exists, then in most situations Assign() should be used to create/write to the variable and Eval() should be used to read from the variable.
fr: Si il est nécessaire d'utiliser IsDeclared() pour savoir si une variable existe, alors dans la plupart des situations Assign() devrait être utilisée pour créer/écrire dans la variable et Eval() devrait être utilisé pour lire la variable.

source: Check if the variable $vVar is declared.
fr: Vérifie si la variable $Vvar est déclarée.

source: As the variable isn't will display the error message.
fr: Comme la variable ne l'est pas, affiche un message d'erreur.

source: Initialize the variable $vVar with data.
fr: Initialise la variable $Vvar avec des données.

source: Checks if a variable is a DllStruct type.
fr: Vérifie si une variable est de type DllStruct.

source: 0 if expression is not DllStruct type as return by DllStructCreate.
fr: Retourne 0 si l'expression n'est pas de type DllStruct comme la valeur de retour de DllStructCreate.

source: Checks if the value of a variable or expression has a fractional component.
fr: Vérifie si la valeur d'une variable ou expression a une partie fractionnaire.

source: 1 - Fractional component
fr: Retourne 1 - Partie fractionnaire

source: 0 - No fractional component
fr: Retourne 0 - Aucune partie fractionnaire

source: The function will return 0 if the value is a float with no fractional component (e.g.1.000).
fr: La fonction retourne 0 si la valeur est un 'float' sans partie fractionnaire (par exemple 1000).

source: Returns 1
fr: Retourne 1

source: Returns 0 as the value is an integer i.e.3
fr: Retourne 0 = la valeur est un nombre entier à savoir 3

source: Returns 0 as 1.5e3 is equal to 1500.
fr: Retourne 0 car 1.5e3 est égale à 1500.

source: Returns 0 as the value is a string.
fr: Retourne la valeur 0 car c'est une chaîne.

source: Checks if a variable or expression is a function type.
fr: Détermine si une variable ou une expression est du type fonction.

source: 1 if the variable is a User-defined function, 2 if the variable is a native function.
fr: Retourne 1 si la variable est une fonction définie par l'utilisateur, 2 si la variable est une fonction native.

source: 0 if expression is not function type.
fr: Retourne 0 si l'expression n'est pas du type fonction.

source: Display a MsgBox that shows $hMsgBox is a native function.
fr: Affiche une MsgBox qui montre $hMsgBox est une fonction native.

source: Re-assign the variable $hMsgBox with our user-defined message box function.
fr: Ré-assigne la variable $hMsgBox avec notre fonction de boîte de message défini par l'utilisateur.
